IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-VARYING-AFTER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2).
01 WS-J PIC 9(2).
01 WS-TRACE-NUM PIC 9(2).
PROCEDURE DIVISION.
MAIN.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 2 AFTER WS-J FROM 1 BY 1 UNTIL WS-J > 3
        MOVE WS-J TO WS-TRACE-NUM
    END-PERFORM.
    GOBACK.
