IDENTIFICATION DIVISION.
PROGRAM-ID. GOTO-IRREDUCIBLE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SWITCH-VALUE PIC 9 VALUE 1.
PROCEDURE DIVISION.
MAIN.
    GO TO PARA-A PARA-B DEPENDING ON SWITCH-VALUE.
PARA-A.
    GO TO PARA-B.
PARA-B.
    GO TO PARA-A.
