IDENTIFICATION DIVISION.
PROGRAM-ID. EVALUATE-88.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 STATUS-CODE PIC X VALUE 'A'.
   88 STATUS-ACTIVE VALUE 'A'.
   88 STATUS-CLOSED VALUE 'C'.
01 RESULT-CODE PIC 9.
PROCEDURE DIVISION.
MAIN.
    EVALUATE TRUE
      WHEN STATUS-ACTIVE MOVE 1 TO RESULT-CODE
      WHEN STATUS-CLOSED MOVE 2 TO RESULT-CODE
      WHEN OTHER MOVE 9 TO RESULT-CODE
    END-EVALUATE.
    STOP RUN.
