IDENTIFICATION DIVISION.
PROGRAM-ID. MOVE-NUMERIC.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SOURCE-NUM PIC S9(5)V99 VALUE -12.34.
01 TARGET-NUM PIC S9(3)V99.
PROCEDURE DIVISION.
MAIN.
    MOVE SOURCE-NUM TO TARGET-NUM.
    STOP RUN.
