IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-TIMES.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TRACE PIC X(10).
PROCEDURE DIVISION.
MAIN.
    PERFORM 3 TIMES
        MOVE 'READY' TO WS-TRACE
    END-PERFORM.
    GOBACK.