IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-UNTIL-AFTER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COUNT PIC 9(2).
PROCEDURE DIVISION.
MAIN.
    PERFORM WITH TEST AFTER UNTIL WS-COUNT > 0
        MOVE 1 TO WS-COUNT
    END-PERFORM.
    GOBACK.
