IDENTIFICATION DIVISION.
PROGRAM-ID. ODO-INVALID.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ITEM-COUNT PIC 9 VALUE 9.
01 ITEMS.
   05 ITEM-VALUE PIC X OCCURS 1 TO 5 TIMES DEPENDING ON ITEM-COUNT.
PROCEDURE DIVISION.
MAIN.
    STOP RUN.
