IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-VARYING.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-IDX PIC 9(2).
01 WS-TRACE-NUM PIC 9(2).
PROCEDURE DIVISION.
MAIN.
    PERFORM VARYING WS-IDX FROM 1 BY 1 UNTIL WS-IDX > 3
        MOVE WS-IDX TO WS-TRACE-NUM
    END-PERFORM.
    GOBACK.