IDENTIFICATION DIVISION.
PROGRAM-ID. INITIALIZE-SET.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CUSTOMER-NAME PIC X(4).
01 CUSTOMER-COUNT PIC 9(3).
01 CUSTOMER-STATUS PIC X.
   88 CUSTOMER-READY VALUE 'Y'.
PROCEDURE DIVISION.
MAIN.
    INITIALIZE CUSTOMER-NAME CUSTOMER-COUNT.
    SET CUSTOMER-READY TO TRUE.
    SET CUSTOMER-READY TO FALSE.
    GOBACK.
