       01 CARD-ACCOUNT.
          05 CARD-ID              PIC X(16).
          05 CUSTOMER-ID          PIC X(10).
          05 CARD-STATUS          PIC X(01).
          05 CREDIT-LIMIT         PIC 9(9)V99.
          05 CURRENT-BALANCE      PIC 9(9)V99.
