IDENTIFICATION DIVISION.
PROGRAM-ID. ODO-VALID.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ITEM-COUNT PIC 9 VALUE 1.
01 ITEMS.
   05 ITEM-VALUE PIC X OCCURS 1 TO 5 TIMES DEPENDING ON ITEM-COUNT.
PROCEDURE DIVISION.
MAIN.
    MOVE 5 TO ITEM-COUNT.
    STOP RUN.
