IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-NESTED.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TRACE PIC X(10).
PROCEDURE DIVISION.
MAIN.
    PERFORM OUTER-PARA.
    STOP RUN.
OUTER-PARA.
    MOVE '1-OUTER' TO WS-TRACE.
    PERFORM INNER-PARA.
INNER-PARA.
    MOVE '2-INNER' TO WS-TRACE.