IDENTIFICATION DIVISION.
PROGRAM-ID. PERFORM-THRU.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-FIRST PIC X(10).
01 WS-SECOND PIC X(10).
PROCEDURE DIVISION.
MAIN.
    PERFORM 1000-PARA THRU 2000-PARA.
    GOBACK.
1000-PARA.
    MOVE '1-1000' TO WS-FIRST.
2000-PARA.
    MOVE '2-2000' TO WS-SECOND.