       IDENTIFICATION DIVISION.
       PROGRAM-ID. EQUIVALENCE-BALANCE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BALANCE PIC 9(4) VALUE 1200.
       01 DEBIT PIC 9(4) VALUE 250.
       01 RESULT PIC 9(4).
       PROCEDURE DIVISION.
           COMPUTE RESULT = BALANCE - DEBIT
           DISPLAY RESULT
           STOP RUN.
