IDENTIFICATION DIVISION.
PROGRAM-ID. MOVE-ALPHA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 SOURCE-TEXT PIC X(8) VALUE 'ABCD'.
01 SHORT-TEXT PIC X(2).
01 LONG-TEXT PIC X(10).
PROCEDURE DIVISION.
MAIN.
    MOVE SOURCE-TEXT TO SHORT-TEXT LONG-TEXT.
    STOP RUN.
